---
kind: other
id: Methods.T:Autodesk.Revit.UI.PulldownButton
source: html/d7761401-7f2b-24e9-64f0-6dd4202414c2.htm
---
# PulldownButton Methods

Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand.